department_work/water-flow-with-particles-main/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "5";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
36000
(
(0.0223803 -0.401698 0.0223247)
(-0.00413678 -0.400056 0.0218956)
(0.00358776 -0.400777 0.0216332)
(-0.00118035 -0.400866 0.0216035)
(0.00125966 -0.400838 0.0215687)
(-0.00109328 -0.400828 0.0215591)
(0.00138391 -0.400864 0.0216166)
(-0.00340501 -0.400763 0.0216238)
...
)
;

boundaryField
{
    wall
    {
        type            noSlip;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
200
(
(0.129031 0.00733343 0.00576617)
(0.136185 0.00537707 0.00497842)
(0.126164 0.00457611 0.00188405)
(0.12252 0.00443767 0.00114104)
(0.121689 0.00463082 -0.000190042)
(0.121694 0.00463103 0.000172433)
(0.122536 0.00443783 -0.00115662)
(0.126185 0.00457729 -0.00189685)
...
)
;
    }
    baffle4
    {
        type            noSlip;
    }
    baffle3
    {
        type            noSlip;
    }
    baffle2
    {
        type            noSlip;
    }
    baffle1
    {
        type            noSlip;
    }
    bottomInlet
    {
        type            fixedValue;
        value           uniform (0 0.4 0);
    }
    topInlet
    {
        type            fixedValue;
        value           uniform (0 -0.4 0);
    }
}


// ************************************************************************* //
