department_work/water-flow-with-particles-main/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "5";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
36000
(
0.00123777
0.00123759
0.00123661
0.00123632
0.00123629
0.00123627
0.00123636
0.00123658
...
)
;

boundaryField
{
    wall
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
11200
(
5.32384
5.09561
4.55772
3.87311
2.98963
1.81556
6.80311
6.45902
...
)
;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 2;
        value           nonuniform List<scalar> 
200
(
0.00647389
0.00935391
0.0119275
0.0132174
0.0139616
0.0139617
0.0132176
0.0119281
...
)
;
    }
    baffle4
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
280
(
0.00680367
5.32384
0.0144888
7.55729
0.018481
9.60571
0.0205155
10.2548
...
)
;
    }
    baffle3
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
280
(
0.467728
4.75187
0.719311
6.68765
0.848687
8.484
1.07318
8.79918
...
)
;
    }
    baffle2
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
280
(
0.405379
1.3212
0.618254
1.91914
0.713543
2.12931
0.899735
2.06485
...
)
;
    }
    baffle1
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
280
(
0.110596
0.0187553
0.235327
0.0486868
0.284573
0.0620567
0.269092
0.0655572
...
)
;
    }
    bottomInlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.05;
        phi             phi;
        k               k;
        value           uniform 4.82991e-05;
    }
    topInlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.05;
        phi             phi;
        k               k;
        value           uniform 4.82991e-05;
    }
}


// ************************************************************************* //
