department_work/water-flow-with-particles-main/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "5";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
36000
(
0.00062012
0.000620058
0.00061973
0.000619633
0.000619625
0.000619619
0.000619648
0.00061972
...
)
;

boundaryField
{
    wall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
11200
(
0.164008
0.159287
0.14787
0.132664
0.111633
0.0800549
0.193131
0.186563
...
)
;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           nonuniform List<scalar> 
200
(
0.00186849
0.00238805
0.00280811
0.00300708
0.00311892
0.00311894
0.00300711
0.0028082
...
)
;
    }
    baffle4
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
280
(
0.00193142
0.164008
0.00319696
0.207153
0.00376009
0.243072
0.00403121
0.253902
...
)
;
    }
    baffle3
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
280
(
0.0324123
0.15204
0.0431843
0.19094
0.0482184
0.22376
0.0563849
0.229268
...
)
;
    }
    baffle2
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
280
(
0.0294638
0.064768
0.0390384
0.0830714
0.0429531
0.0890308
0.0501331
0.0872249
...
)
;
    }
    baffle1
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
280
(
0.0123939
0.0037972
0.0205035
0.00717226
0.0232725
0.00843154
0.0224207
0.00874571
...
)
;
    }
    bottomInlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.0006;
    }
    topInlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.0006;
    }
}


// ************************************************************************* //
