department_work/water-flow-with-particles-main/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "5";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
36000
(
2.7961e-05
2.79596e-05
2.79522e-05
2.795e-05
2.79498e-05
2.79497e-05
2.79503e-05
2.7952e-05
...
)
;

boundaryField
{
    wall
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
11200
(
4.79282e-05
4.72947e-05
4.57191e-05
4.35132e-05
4.02198e-05
3.45558e-05
5.16322e-05
5.08251e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
4.85356e-05
5.48702e-05
5.95006e-05
6.15725e-05
6.27071e-05
6.27073e-05
6.15729e-05
5.95016e-05
...
)
;
    }
    baffle4
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
280
(
5.97684e-06
4.79282e-05
7.66735e-06
5.33063e-05
8.29681e-06
5.73307e-05
8.58111e-06
5.84795e-05
...
)
;
    }
    baffle3
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
280
(
2.28298e-05
4.63021e-05
2.60486e-05
5.13646e-05
2.74002e-05
5.52108e-05
2.9437e-05
5.58253e-05
...
)
;
    }
    baffle2
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
280
(
2.18486e-05
3.13651e-05
2.48688e-05
3.51447e-05
2.59845e-05
3.62745e-05
2.78938e-05
3.59366e-05
...
)
;
    }
    baffle1
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
280
(
1.46208e-05
8.33638e-06
1.84789e-05
1.13035e-05
1.95945e-05
1.22018e-05
1.92595e-05
1.24141e-05
...
)
;
    }
    bottomInlet
    {
        type            calculated;
        value           uniform 0.00067082;
    }
    topInlet
    {
        type            calculated;
        value           uniform 0.00067082;
    }
}


// ************************************************************************* //
