department_work/water-flow-with-particles-main/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "5";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
36000
(
11.9241
11.9062
11.917
11.9124
11.9146
11.9148
11.9126
11.9176
...
)
;

boundaryField
{
    wall
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    baffle4
    {
        type            zeroGradient;
    }
    baffle3
    {
        type            zeroGradient;
    }
    baffle2
    {
        type            zeroGradient;
    }
    baffle1
    {
        type            zeroGradient;
    }
    bottomInlet
    {
        type            zeroGradient;
    }
    topInlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
