department_work/water-flow-with-particles-main/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "5";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
101640
(
-6.53673e-07
-6.50427e-07
4.13041e-05
-7.71673e-08
-6.50127e-07
4.00736e-05
-6.43138e-08
-6.47041e-07
...
)
;

boundaryField
{
    wall
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
1.2906e-05
1.3622e-05
1.26196e-05
1.22549e-05
1.21715e-05
1.2172e-05
1.22564e-05
1.26218e-05
...
)
;
    }
    baffle4
    {
        type            calculated;
        value           uniform 0;
    }
    baffle3
    {
        type            calculated;
        value           uniform 0;
    }
    baffle2
    {
        type            calculated;
        value           uniform 0;
    }
    baffle1
    {
        type            calculated;
        value           uniform 0;
    }
    bottomInlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
-4e-05
-4e-05
-4e-05
-4e-05
-4e-05
-4e-05
-4e-05
-4e-05
...
)
;
    }
    topInlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
-4e-05
-4e-05
-4e-05
-4e-05
-4e-05
-4e-05
-4e-05
-4e-05
...
)
;
    }
}


// ************************************************************************* //
