department_work/water-flow-with-particles-main/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          11200;
        startFace       101640;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       112840;
    }
    baffle4
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          280;
        startFace       113040;
    }
    baffle3
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          280;
        startFace       113320;
    }
    baffle2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          280;
        startFace       113600;
    }
    baffle1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          280;
        startFace       113880;
    }
    bottomInlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       114160;
    }
    topInlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       114260;
    }
)

// ************************************************************************* //
